In [1]:
import random as rdm
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("salario.csv")
df

,id,pais,estado,cidade,genero,data,salario
0,1,United States,Alabama,Mobile,Male,10/01/1987,$5407.86
1,2,Portugal,Porto,Rego,Male,29/11/2007,$7833.82
2,3,Sweden,Kalmar,Emmaboda,Male,23/06/1984,$5530.85
3,4,Sweden,Västmanland,Sala,Female,04/11/1983,$2803.76
4,5,France,Bretagne,Quimperlé,Female,18/11/1990,$2201.87
...,...,...,...,...,...,...,...
995,996,Canada,Saskatchewan,Nipawin,Female,29/11/1995,$7782.63
996,997,Portugal,Portalegre,Santo Aleixo,Female,09/02/1988,$4772.43
997,998,France,Île-de-France,Boissy-Saint-Léger,Male,17/10/1990,$5004.78
998,999,France,Bretagne,Rennes,Male,23/09/1996,$5362.26
999,1000,Mexico,Guanajuato,Lindavista,Female,19/11/2006,$3737.37

In [2]:
class Generalizacao:
    def __init__(self,nome):
        self.filhos = []
        self.nome = nome
    def adicionarFilho(self,filho):
        if
    def toString(self):
ArvoreDatas = Generalizacao("**/**/****")

In [43]:
datas = []
for i in range(50):
    data = "%d/%d/%d"%(rdm.randint(1,2),rdm.randint(1,2),rdm.randint(2010,2011))
    datas.append(data)
datas

['2/2/2011',
 '2/2/2010',
 '2/1/2011',
 '1/2/2010',
 '2/2/2010',
 '1/2/2010',
 '1/1/2011',
 '1/1/2011',
 '2/1/2011',
 '1/2/2010',
 '2/2/2011',
 '2/2/2011',
 '1/2/2011',
 '2/1/2010',
 '1/1/2010',
 '2/1/2011',
 '1/2/2011',
 '1/2/2010',
 '2/1/2010',
 '2/1/2011',
 '1/2/2011',
 '2/1/2011',
 '1/2/2011',
 '2/2/2011',
 '2/1/2011',
 '2/1/2011',
 '2/2/2011',
 '2/2/2011',
 '2/1/2011',
 '2/2/2011',
 '2/2/2010',
 '2/2/2011',
 '1/1/2010',
 '2/2/2011',
 '1/2/2011',
 '1/1/2011',
 '2/2/2010',
 '2/2/2011',
 '2/2/2010',
 '2/2/2011',
 '1/1/2011',
 '1/2/2010',
 '1/2/2011',
 '2/1/2011',
 '2/1/2010',
 '1/2/2011',
 '1/2/2011',
 '1/2/2010',
 '2/1/2011',
 '2/1/2011']

In [45]:
a = [[data] for data in datas]

In [46]:
b = np.array(a)

In [47]:
df = pd.DataFrame(b)
type(df)

pandas.core.frame.DataFrame

In [50]:
print(df.groupby[0].count())
#df.groupby(0)[0]
#.to_frame()
for i in df.groupby(0):
    print(i)

TypeError: 'method' object is not subscriptable